Performance/Script/Web/WebClient - MR1/WebServices1/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/CreateFilmFile</wsa:Action><wsa:MessageID>uuid:0208a1f1-ac38-46dd-b3ae-4afeb5bdd4e6</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://10.184.129.108/PerformanceTest/CreateFilmTestData.asmx</wsa:To></soap:Header><soap:Body><CreateFilmFile xmlns="http://tempuri.org/"><strfilename>A20180126160715000</strfilename><strDate>20180126</strDate><strtime>160715000</strtime><strPID>P20180126160715000</strPID><strStudyInstanceUID>StudyUID20180126160715000</strStudyInstanceUID><strSeriesInstanceUID>StudyUID20180126160715000</strSeriesInstanceUID><strSOPInstanceID>SOP20180126160715000</strSOPInstanceID><strAccNo>A20180126160715000</strAccNo><strPatientName>PN20180126160715000</strPatientName><strGrender>F</strGrender><strModality>KO</strModality><strBodayPart>foot</strBodayPart><strDestFolder>E:\GX Platform\Inbox</strDestFolder></CreateFilmFile></soap:Body></soap:Envelope>