Performance/Script/Web/WebClient - MR1/WebServices1/result1/Iteration1/t2_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST http://10.184.129.108/PerformanceTest/CreateFilmTestData.asmx HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://tempuri.org/CreateFilmFile"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Proxy-Connection: Keep-Alive
Host: 10.184.129.108
Content-Length: 1280

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://tempuri.org/CreateFilmFile&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:0208a1f1-ac38-46dd-b3ae-4afeb5bdd4e6&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://10.184.129.108/PerformanceTest/CreateFilmTestData.asmx&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;CreateFilmFile xmlns="http://tempuri.org/"&gt;
      &lt;strfilename&gt;A20180126160715000&lt;/strfilename&gt;
      &lt;strDate&gt;20180126&lt;/strDate&gt;
      &lt;strtime&gt;160715000&lt;/strtime&gt;
      &lt;strPID&gt;P20180126160715000&lt;/strPID&gt;
      &lt;strStudyInstanceUID&gt;StudyUID20180126160715000&lt;/strStudyInstanceUID&gt;
      &lt;strSeriesInstanceUID&gt;StudyUID20180126160715000&lt;/strSeriesInstanceUID&gt;
      &lt;strSOPInstanceID&gt;SOP20180126160715000&lt;/strSOPInstanceID&gt;
      &lt;strAccNo&gt;A20180126160715000&lt;/strAccNo&gt;
      &lt;strPatientName&gt;PN20180126160715000&lt;/strPatientName&gt;
      &lt;strGrender&gt;F&lt;/strGrender&gt;
      &lt;strModality&gt;KO&lt;/strModality&gt;
      &lt;strBodayPart&gt;foot&lt;/strBodayPart&gt;
      &lt;strDestFolder&gt;E:\GX Platform\Inbox&lt;/strDestFolder&gt;
    &lt;/CreateFilmFile&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/7.5
X-AspNet-Version: 4.0.30319
X-Powered-By: ASP.NET
Date: Fri, 26 Jan 2018 08:01:56 GMT
Content-Length: 372

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;
  &lt;soap:Body&gt;
    &lt;CreateFilmFileResponse xmlns="http://tempuri.org/"&gt;
      &lt;CreateFilmFileResult&gt;true&lt;/CreateFilmFileResult&gt;
    &lt;/CreateFilmFileResponse&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </response>
  </http>
</report>